<?php
// +----------------------------------------------------------------------
// | tpvue [ 模块化渐进式后台 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018-2019 http://tpvue.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: jry <598821125@qq.com>
// +----------------------------------------------------------------------

// 模块信息配置
return array(
    // 模块信息
    'info'       => array(
        'name'        => 'core',
        'title'       => '核心',
        'description' => 'tpvue核心模块',
        'developer'   => 'jry',
        'website'     => 'http://tpvue.com',
        'version'     => '0.0.1',
    ),

    // 模块路由
    'route'     => array(
        // 资源路由
        'resource' => array(
            'core/user' => 'core/user',
        )
    ),
);
