<?php
/**
 * +----------------------------------------------------------------------
 * | xycloud [ 渐进式后端云 ]
 * +----------------------------------------------------------------------
 * | Copyright (c) 2018-2020 http://jiangruyi.com All rights reserved.
 * +----------------------------------------------------------------------
 * | Author: jry <598821125@qq.com>
 * +----------------------------------------------------------------------
 * | 版权申明：此源码不是一个自由软件，是jry推出的私有源码，严禁在未经许可的情况下
 * | 拷贝、复制、传播、使用此源码的任意代码，如有违反，请立即删除，否则您将面临承担相应
 * | 法律责任的风险。如果需要取得官方授权，请联系官方QQ598821125。
*/

/**
 * 安装配置
 *
 * @author jry <ijry@qq.com>
 */
return [
    // 导出配置
    'export' => [
        'table' => [
            'rowLimit' => [
                'core_config' => 0,
                'core_menu' => 0,
                'core_module' => 1,
                'core_identity' => 0,
                'core_role' => 3,
                'core_user' => 0,
                'core_job' => 0,
                'core_login' => 0,
                'core_user_log' => 0
            ]
        ]
    ]
];
